In [1]:
import pandas as pd

In [4]:
import pandas as pd
dict1 = {'Name':['Hasham','Haris','Junaid','Uzair','Hammas','Ahmed','Ali'],
         'Marks':[98,89,99,87,90,83,99],
         'Gender':['Male','Female','Female','Male','Male','Female','Male']
           }

df1 = pd.DataFrame(dict1)
df1

     Name  Marks  Gender
0  Hasham     98    Male
1   Haris     89  Female
2  Junaid     99  Female
3   Uzair     87    Male
4  Hammas     90    Male
5   Ahmed     83  Female
6     Ali     99    Male

Display top 3 rows

In [5]:
df1.head(3)

     Name  Marks  Gender
0  Hasham     98    Male
1   Haris     89  Female
2  Junaid     99  Female

Dispay bottom 3 vlaue

In [7]:
df1.tail(3)

     Name  Marks  Gender
4  Hammas     90    Male
5   Ahmed     83  Female
6     Ali     99    Male

Find a shape (how nay rows and coloumns)

In [9]:
df1.shape

(7, 3)

In [11]:
print('Number of Rows', df1.shape[0])
print('Number of Columns',df1.shape[0])

Number of Rows 7
Number of Columns 7

Total number of rows and columns and datatypes of each column and memory requirements

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

Check Null values in the dataset

In [17]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

Overall statistics about the dataframe

In [19]:
df1.describe(include='all')

          Name      Marks Gender
count        7   7.000000      7
unique       7        NaN      2
top     Hasham        NaN   Male
freq         1        NaN      4
mean       NaN  92.142857    NaN
std        NaN   6.491753    NaN
min        NaN  83.000000    NaN
25%        NaN  88.000000    NaN
50%        NaN  90.000000    NaN
75%        NaN  98.500000    NaN
max        NaN  99.000000    NaN

Find Unique Values from the Gender Column

In [20]:
 df1

     Name  Marks  Gender
0  Hasham     98    Male
1   Haris     89  Female
2  Junaid     99  Female
3   Uzair     87    Male
4  Hammas     90    Male
5   Ahmed     83  Female
6     Ali     99    Male

In [22]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

Find the Number of unique values from the gender coloumn

In [24]:
df1['Gender'].nunique()

2

Display Counts of unique values in gender column

In [25]:
df1['Gender'].value_counts()

Gender
Male      4
Female    3
Name: count, dtype: int64

Find Total number of students having marks between 90 to 100 using between method

In [28]:
df1[df1['Marks']>=90]

     Name  Marks  Gender
0  Hasham     98    Male
2  Junaid     99  Female
4  Hammas     90    Male
6     Ali     99    Male

In [31]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [33]:
sum(df1['Marks'].between(90,100))

4

Find Average Marks

In [34]:
df1

     Name  Marks  Gender
0  Hasham     98    Male
1   Haris     89  Female
2  Junaid     99  Female
3   Uzair     87    Male
4  Hammas     90    Male
5   Ahmed     83  Female
6     Ali     99    Male

In [39]:
df1['Marks'].mean()

92.14285714285714

apply Method

In [51]:
def marks(x):
    return x/2

In [50]:
df1['Half_makrs']=df1['Marks'].apply(marks)

In [52]:
df1

     Name  Marks  Gender  Half_makrs
0  Hasham     98    Male        49.0
1   Haris     89  Female        44.5
2  Junaid     99  Female        49.5
3   Uzair     87    Male        43.5
4  Hammas     90    Male        45.0
5   Ahmed     83  Female        41.5
6     Ali     99    Male        49.5

In [53]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [54]:
df1['Name'].apply(len)

0    6
1    5
2    6
3    5
4    6
5    5
6    3
Name: Name, dtype: int64

Map Funcation

In [55]:
df1

     Name  Marks  Gender  Half_makrs
0  Hasham     98    Male        49.0
1   Haris     89  Female        44.5
2  Junaid     99  Female        49.5
3   Uzair     87    Male        43.5
4  Hammas     90    Male        45.0
5   Ahmed     83  Female        41.5
6     Ali     99    Male        49.5

In [58]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [59]:
df1

     Name  Marks  Gender  Half_makrs  Male_Female
0  Hasham     98    Male        49.0            1
1   Haris     89  Female        44.5            0
2  Junaid     99  Female        49.5            0
3   Uzair     87    Male        43.5            1
4  Hammas     90    Male        45.0            1
5   Ahmed     83  Female        41.5            0
6     Ali     99    Male        49.5            1

Drop the column

In [60]:
df1

     Name  Marks  Gender  Half_makrs  Male_Female
0  Hasham     98    Male        49.0            1
1   Haris     89  Female        44.5            0
2  Junaid     99  Female        49.5            0
3   Uzair     87    Male        43.5            1
4  Hammas     90    Male        45.0            1
5   Ahmed     83  Female        41.5            0
6     Ali     99    Male        49.5            1

In [61]:
df1.drop('Male_Female',axis=1)

     Name  Marks  Gender  Half_makrs
0  Hasham     98    Male        49.0
1   Haris     89  Female        44.5
2  Junaid     99  Female        49.5
3   Uzair     87    Male        43.5
4  Hammas     90    Male        45.0
5   Ahmed     83  Female        41.5
6     Ali     99    Male        49.5

In [64]:
df1.drop(['Male_Female','Half_makrs'],axis=1, inplace= True)

In [65]:
df1

     Name  Marks  Gender
0  Hasham     98    Male
1   Haris     89  Female
2  Junaid     99  Female
3   Uzair     87    Male
4  Hammas     90    Male
5   Ahmed     83  Female
6     Ali     99    Male

  Print Names of the Columns

In [66]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [68]:
df1.index

RangeIndex(start=0, stop=7, step=1)

Sort the DataFrame as per the marks columns

In [69]:
df1

     Name  Marks  Gender
0  Hasham     98    Male
1   Haris     89  Female
2  Junaid     99  Female
3   Uzair     87    Male
4  Hammas     90    Male
5   Ahmed     83  Female
6     Ali     99    Male

In [74]:
df1.sort_values(by=['Marks', 'Gender'],ascending = False)

     Name  Marks  Gender
6     Ali     99    Male
2  Junaid     99  Female
0  Hasham     98    Male
4  Hammas     90    Male
1   Haris     89  Female
3   Uzair     87    Male
5   Ahmed     83  Female

Dispaly Name and Marks of the Female students only

In [78]:
df1[df1['Gender'] =='Female'][['Name','Marks']]

     Name  Marks
1   Haris     89
2  Junaid     99
5   Ahmed     83